{
  "attach": { 
    "message": "Attach to:",
    "description":"Attaches your container to a border"
  },  
  "bottom": { 
    "message":"bottom",
    "description":"is on of the possible borders to attach the containers"
  },
  "custom": {
    "message":"Custom:",
    "description":"Is a menu item in the right click menu with user/package made custom items in it"
  },
  "lock": {
    "message":"Lock",
    "description":"Locks the container. Which means it's not movable/resizable anymore and changes some other properties depending on the Lockstyle (like hiding the borders)"
  },
  "lockstyle": {
    "message":"Lockstyle:",
    "description":"There are different modes/styles to choose which will be the lock behaviour of the container"
  },
  "standard": {
    "message":"standard",
    "description":"Is one of the Lockstyles. This Lockstyle is the standard setting, with a small margin on top to keep the right click menu usable"
  },
  "light": {
    "message":"light",
    "description":"Is one of the Lockstyles. Can also be translated as simple. It is only hiding the min/restore labels the borders and margin stays intact"
  },
  "full": {
    "message":"full",
    "description":"Is one of the Lockstyles. Can also be translated as complete as it's locking the container without any margin left for the right click menu."
  },
  "border": { 
    "message":"border",
    "description":"is one of the Lockstyles which keeps the borders of the container visible."
  },
  "top": {
    "message":"top",
    "description":"is one of the possible border the container can be attached to"
  },
  "left": {
    "message":"left",
    "description":"is one of the possible borders the container can be attached to"
  },
  "right": {
    "message":"right",
    "description":"one of the borders the container can be attached to"
  },
  "load": {
    "message":"Load",
    "description":"Loads the previously settings of the container"
  },
  "save": {
    "message":"Save",
    "description":"Saves settings of the container"
  },
  "min_restore": {
    "message":"Min/Restore",
    "description":"Label to minimize/restore the container"
  }
}